Revit 2027 API
CurveByPointsUtils.ValidateCurveElementIdArrayForFaceRegions Method
 Validates that the input CurveElements can define FaceRegions. The CurveElements must be CurveByPoints. Each curve must be entirely hosted by a single Face or hosts related to a common Face (for example, Edges of a common Face, other CurveElements hosted by a common Face). To be added to the FaceRegion definition, a CurveElement must have the SketchOnSurface attribute set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ValidateCurveElementIdArrayForFaceRegions(
	Document document,
	IList<ElementId> curveElemIds
)
Public Shared Function ValidateCurveElementIdArrayForFaceRegions (
	document As Document,
	curveElemIds As IList(Of ElementId)
) As Boolean
public:
static bool ValidateCurveElementIdArrayForFaceRegions(
	Document^ document,
	IList<ElementId^>^ curveElemIds
)
static member ValidateCurveElementIdArrayForFaceRegions :
        document : Document *
        curveElemIds : IList<ElementId> -> bool
Parameters
document Document
 The Document.
curveElemIds IList<ElementId>
 The CurveElements.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace